PBL5/4_Facebook_Newsfeed/loadtest/scalingTest/scalingTest.yml
config:
  name: "Realistic Scaling Test - Warm-up to 200 req/s Peak"
  target: "http://localhost:3000"
  phases:
    # Phase 1: Warm-up - Slow start, warm up caches
    - duration: 60
      arrivalRate: 10
      name: "Warm-up: 10 req/s (system initialization)"
    
    # Phase 2: Ramp up - Gradually increase load
    - duration: 120
      arrivalRate: 30
      name: "Ramp up: 30 req/s"
    
    # Phase 3: Normal Load - Baseline traffic
    - duration: 180
      arrivalRate: 50
      name: "Normal Load: 50 req/s (baseline)"
    
    # Phase 4: Active Load - High engagement
    - duration: 180
      arrivalRate: 100
      name: "Active Load: 100 req/s (high engagement)"
    
    # Phase 5: Peak Load - Maximum realistic load
    - duration: 120
      arrivalRate: 200
      name: "Peak Load: 200 req/s (maximum load)"
    
    # Phase 6: Slow Down - Gradual decrease
    - duration: 120
      arrivalRate: 100
      name: "Slow Down: 100 req/s"
    
    # Phase 7: Cool-down - Final phase, system recovery
    - duration: 60
      arrivalRate: 20
      name: "Cool-down: 20 req/s (system recovery)"
  
  # Combined payload at config level - all scenarios use this
  payload:
    path: "./data/all_data.csv"
    fields:
      - "user_id"
      - "post_id"
      - "post_content"
      - "comment_content"
    order: "random"
    skipHeader: true
    cast: true
  
  plugins:
    expect: {}
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # All scenarios run in parallel with realistic distribution
  # NO USER CREATION - users already exist
  
  # Feed fetching (65% of traffic) - Most common activity
  - name: "Get Feed"
    weight: 65
    flow:
      - get:
          url: "/api/feed/{{ user_id }}"
          expect:
            - statusCode: 200  # Only 200 is success, 400/404/500 will be marked as failed
            - contentType: json
      - think: 3

  # Create Post (12% of traffic) - Less frequent
  - name: "Create Post"
    weight: 12
    flow:
      - post:
          url: "/api/posts"
          json:
            user_id: "{{ user_id }}"
            content: "{{ post_content }}"
          expect:
            - statusCode: 201  # Only 201 is success, 400/404/500 will be marked as failed
      - think: 2

  # Like Post (18% of traffic) - Common quick interaction
  - name: "Like Post"
    weight: 18
    flow:
      - post:
          url: "/api/posts/{{ post_id }}/like"
          json:
            user_id: "{{ user_id }}"
          expect:
            - statusCode: [200, 201]  # 200 (unlike) or 201 (like) are success, 400/404/500 will be marked as failed
      - think: 1

  # Comment on Post (5% of traffic) - Least common
  - name: "Comment on Post"
    weight: 5
    flow:
      - post:
          url: "/api/posts/{{ post_id }}/comment"
          json:
            user_id: "{{ user_id }}"
            content: "{{ comment_content }}"
          expect:
            - statusCode: 201  # Only 201 is success, 400/404/500 will be marked as failed
      - think: 2